<a href="https://colab.research.google.com/github/anew0m/AStudy_Pandas-basic/blob/main/study/08_Combine_Data_Sets.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 08_Combine Data Sets

## 14) merge로 데이터프레임 합치기 left, right, inner, outer 옵션 사용하기

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.DataFrame({"x1" : ["A", "B", "C"], "x2" : [1, 2, 3]})

  x1  x2
0  A   1
1  B   2
2  C   3

In [4]:
adf = pd.DataFrame({"x1" : ["A", "B", "C"], "x2" : [1, 2, 3]})
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [5]:
bdf = pd.DataFrame({"x1" : ["A", "B", "D"], "x3" : ["T", "F", "T"]})
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [6]:
pd.merge(adf, bdf, how = 'left', on = 'x1')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [7]:
pd.merge?

In [8]:
pd.merge(adf, bdf, how = 'right', on = 'x1')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [9]:
pd.merge(adf, bdf, how = 'inner', on = 'x1')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [10]:
pd.merge(adf, bdf, how = 'outer', on = 'x1')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [11]:
bdf.x1

0    A
1    B
2    D
Name: x1, dtype: object

In [12]:
adf.x1.isin(bdf.x1)

0     True
1     True
2    False
Name: x1, dtype: bool

In [13]:
adf[adf.x1.isin(bdf.x1)]

  x1  x2
0  A   1
1  B   2

In [14]:
adf[~adf.x1.isin(bdf.x1)]

  x1  x2
2  C   3

In [15]:
ydf = pd.DataFrame({"x1" : ["A", "B", "C"], "x2" : [1, 2, 3]})
ydf

  x1  x2
0  A   1
1  B   2
2  C   3

In [21]:
zdf = pd.DataFrame({"x1" : ["B", "C", "D"], "x2" : [2, 3, 4]})
zdf

  x1  x2
0  B   2
1  C   3
2  D   4

In [22]:
pd.merge(ydf, zdf)

  x1  x2
0  B   2
1  C   3

In [23]:
pd.merge(ydf, zdf, how = 'outer')

  x1  x2
0  A   1
1  B   2
2  C   3
3  D   4

In [24]:
pd.merge(ydf, zdf, how = 'outer', indicator = True)

  x1  x2      _merge
0  A   1   left_only
1  B   2        both
2  C   3        both
3  D   4  right_only

In [27]:
pd.merge(ydf, zdf, how = 'outer', indicator = True) \
.query('_merge == "left_only"')

  x1  x2     _merge
0  A   1  left_only

In [28]:
pd.merge(ydf, zdf, how = 'outer', indicator = True) \
.query('_merge == "left_only"') \
.drop(columns = ['_merge'])

  x1  x2
0  A   1

* indicator => 조인방식 설명, '_merge' 컬럼 발생